# Pandas

## Tasks Today:

0) <b>Pre-Work</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; a) Numpy Random Sampling

1) <b>Pandas</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; a) Importing <br>
 &nbsp;&nbsp;&nbsp;&nbsp; b) Tabular Data Structures <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - from_dict() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - read_csv() <br>
 &nbsp;&nbsp;&nbsp;&nbsp; c) <b>In-Class Exercise #1</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; d) Accessing Data <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Indexing <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - df.loc <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - keys() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Slicing a DataFrame <br>
 &nbsp;&nbsp;&nbsp;&nbsp; e) Built-In Methods <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - head() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - tail() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - shape <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - describe() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - sort_values() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - .columns <br>
 &nbsp;&nbsp;&nbsp;&nbsp; f) <b>In-Class Exercise #2</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; g) Filtration <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Conditionals <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Subsetting <br>
 &nbsp;&nbsp;&nbsp;&nbsp; h) Column Transformations <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Generating a New Column w/Data <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - User Defined Function <br>
 &nbsp;&nbsp;&nbsp;&nbsp; i) Aggregations <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - groupby() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Type of groupby() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - mean() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - groupby() w/Multiple Columns <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - drop_duplicates() <br>

## Numpy Random Sampling

In [3]:
import numpy as np

# A single call generates a single random number
print('Here is a random number: %s' % np.random.uniform())
print(f'Here is a random number: {np.random.uniform()}')

# You can also pass some bounds
print('Here is a random number between 0 and 1 Million: %s' % np.random.uniform(0, 1e6))

# You can also generate a bunch of random numbers all at once
print('Here are 3 random numbers between 0 and 1 Million: %s' % np.random.uniform(0, 1e6, 3))

# Even matrices and tensors with weird shapes
print('Here is a 3x3 matrix of random numbers between 0 and 1 Million: \n %s' % np.random.uniform(0, 1e6, (3, 3)))

# instead of float values, generating random integers
print('Using Random Integer: %s' % np.random.randint(0, 10, 4))

Here is a random number: 0.7348170737780044
Here is a random number: 0.7312696371817639
Here is a random number between 0 and 1 Million: 860502.5169432575
Here are 3 random numbers between 0 and 1 Million: [728841.20945438 131997.07673699 415156.79340085]
Here is a 3x3 matrix of random numbers between 0 and 1 Million:
 [[213972.45657014 510090.88447206 461093.69709691]
 [ 94440.70669726 245137.34895328 387930.80815432]
 [665841.11195999 243982.24408585 695097.92298149]]
Using Random Integer: [3 2 6 1]

## Pandas <br>

<p>Pandas is a flexible data analysis library built on top of NumPy that is excellent for working with tabular data. It is currently the de-facto standard for Python-based data analysis, and fluency in Pandas will do wonders for your productivity and frankly your resume. It is one of the fastest ways of getting from zero to answer in existence. </p>

<ul>
    <li>Pandas is a Python module, written in C. The Pandas module is a high performance, highly efficient, and high level data analysis library. It allows us to work with large sets of data called dataframes.</li>
    <li>Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.)</li>
    <li>Dataframe = Spreadsheet (has column headers, index, etc.)</li>
</ul>

### Importing

In [ ]:
!pip install pandas

In [1]:
import pandas as pd

# always use pd, standard for data science

### Tabular data structures <br>
<p>The central object of study in Pandas is the DataFrame, which is a tabular data structure with rows and columns like an excel spreadsheet. The first point of discussion is the creation of dataframes both from native Python dictionaries, and text files through the Pandas I/O system.</p>

In [4]:
names = ['Alice',
         'Bob',
         'James',
         'Beth', 
         'John', 
         'Sally',
         'Richard', 
         'Lauren',
         'Brandon', 
         'Sabrina']

ages = np.random.randint(18,35,len(names))

my_people = {
    'names': names,
    'ages': ages
}

my_people

{'names': ['Alice',
  'Bob',
  'James',
  'Beth',
  'John',
  'Sally',
  'Richard',
  'Lauren',
  'Brandon',
  'Sabrina'],
 'ages': array([26, 28, 21, 21, 29, 22, 19, 21, 29, 34])}

##### from_dict()

<p>Let's convert our not-so-useful-for-analysis dict into a Pandas dataframe. We can use the from_dict function to do this easily using Pandas:</p>

In [5]:
data = pd.DataFrame.from_dict(my_people)

data

     names  ages
0    Alice    26
1      Bob    28
2    James    21
3     Beth    21
4     John    29
5    Sally    22
6  Richard    19
7   Lauren    21
8  Brandon    29
9  Sabrina    34

##### read_csv()

In [11]:
# pd.set_option('display.max_columns', 25)
# pd.set_option('display.max_rows', 100)

marathon = pd.read_csv('../files/boston_marathon2017_edited.csv', sep = ',')

### In-Class Exercise #1 - Read in Boston Red Sox Hitting Data <br>
<p>Use the pandas read_csv() method to read in the statistics from the two files yesterday.</p>

In [2]:
#sep defaults to ',' in read_csv method
bs2017 = pd.read_csv('../files/redsox_2017_hitting.txt', sep=',')
bs2018 = pd.read_csv('../files/redsox_2018_hitting.txt', sep=',')

bs2017

,Rk,Pos,Name,Age,G,PA,AB,R,H,2B,...,OBP,SLG,OPS,OPS+,TB,GDP,HBP,SH,SF,IBB
0,1,C,Christian Vazquez,26,99,345,324,43,94,18,...,0.330,0.404,0.735,91,131,14,3,0,1,0
1,2,1B,Mitch Moreland,31,149,576,508,73,125,34,...,0.326,0.443,0.769,99,225,14,6,0,5,6
2,3,2B,Dustin Pedroia,33,105,463,406,46,119,19,...,0.369,0.392,0.760,100,159,11,2,2,4,4
3,4,SS,Xander Bogaerts,24,148,635,571,94,156,32,...,0.343,0.403,0.746,95,230,17,6,0,2,6
4,5,3B,Rafael Devers,20,58,240,222,34,63,14,...,0.338,0.482,0.819,111,107,5,0,0,0,3
5,6,LF,Andrew Benintendi,22,151,658,573,84,155,26,...,0.352,0.424,0.776,102,243,16,6,1,8,7
6,7,CF,Jackie Bradley Jr.,27,133,541,482,58,118,19,...,0.323,0.402,0.726,89,194,8,9,0,2,4
7,8,RF,Mookie Betts,24,153,712,628,101,166,46,...,0.344,0.459,0.803,108,288,9,2,0,5,9
8,9,DH,Hanley Ramirez,33,133,553,496,58,120,24,...,0.320,0.429,0.750,94,213,15,6,0,0,8
9,10,C,Sandy Leon,28,85,301,271,32,61,14,...,0.290,0.354,0.644,68,96,5,1,1,3,1
10,11,UT,Chris Young,33,90,276,243,30,57,12,...,0.322,0.387,0.709,85,94,4,2,0,1,0
11,12,3B,Deven Marrero,26,71,188,171,32,36,9,...,0.259,0.333,0.593,54,57,8,0,3,2,0
12,13,2B,Eduardo Nunez,30,38,173,165,23,53,12,...,0.353,0.539,0.892,128,89,3,2,0,0,0
13,14,2B,Brock Holt,29,64,164,140,20,28,6,...,0.305,0.243,0.548,47,34,3,3,0,2,0
14,15,IF,Josh Rutledge,28,37,118,107,10,24,2,...,0.297,0.262,0.558,49,28,1,2,0,0,0
15,16,3B,Pablo Sandoval,30,32,108,99,10,21,2,...,0.269,0.354,0.622,61,35,4,0,0,1,0
16,17,UT,Sam Travis,23,33,83,76,13,20,6,...,0.325,0.342,0.667,75,26,2,1,0,0,0
17,18,UT,Tzu-Wei Lin,23,25,66,56,7,15,0,...,0.369,0.339,0.709,88,19,0,0,1,0,0
18,19,IF,Marco Hernandez,24,21,60,58,7,16,3,...,0.300,0.328,0.628,65,19,0,1,0,0,0
19,20,UT,Rajai Davis,36,17,38,36,7,9,2,...,0.289,0.306,0.595,56,11,2,1,0,0,0
20,21,UT,Steve Selsky,27,8,9,9,0,1,1,...,0.111,0.222,0.333,-16,2,0,0,0,0,0
21,22,UT,Blake Swihart,25,6,7,5,1,1,0,...,0.429,0.200,0.629,74,1,0,0,0,0,0
22,23,2B,Chase d'Arnaud,30,2,1,1,2,1,0,...,1.000,1.000,2.000,428,1,0,0,0,0,0

In [15]:
bs2018

,Rk,Pos,Name,Age,G,PA,AB,R,H,2B,3B,HR,...,SO,BA,OBP,SLG,OPS,OPS+,TB,GDP,HBP,SH,SF,IBB
0,1,C,Sandy Leon,29,89,288,265,30,47,12,0,5,...,75,0.177,0.232,0.279,0.511,37,74,6,4,3,1,0
1,2,1B,Mitch Moreland,32,124,459,404,57,99,23,4,15,...,102,0.245,0.325,0.433,0.758,102,175,12,0,0,5,2
2,3,2B,Eduardo Nunez,31,127,502,480,56,127,23,3,10,...,69,0.265,0.289,0.388,0.677,81,186,17,2,1,3,0
3,4,SS,Xander Bogaerts,25,136,580,513,72,148,45,3,23,...,102,0.288,0.360,0.522,0.883,135,268,14,6,0,6,4
4,5,3B,Rafael Devers,21,121,490,450,59,108,24,0,21,...,121,0.240,0.298,0.433,0.731,94,195,9,0,0,2,6
5,6,LF,Andrew Benintendi,23,148,661,579,103,168,41,6,16,...,106,0.290,0.366,0.465,0.830,123,269,9,2,2,7,1
6,7,CF,Jackie Bradley Jr.,28,144,535,474,76,111,33,4,13,...,137,0.234,0.314,0.403,0.717,92,191,6,11,0,4,3
7,8,RF,Mookie Betts,25,136,614,520,129,180,47,5,32,...,91,0.346,0.438,0.640,1.078,186,333,5,8,0,5,8
8,9,DH,J.D. Martinez,30,150,649,569,111,188,37,2,43,...,146,0.330,0.402,0.629,1.031,173,358,19,4,0,7,11
9,10,MI,Brock Holt,30,109,367,321,41,89,18,2,7,...,73,0.277,0.362,0.411,0.774,109,132,7,7,0,2,2
10,11,C,Christian Vazquez,27,80,269,251,24,52,10,0,3,...,41,0.207,0.257,0.283,0.540,46,71,5,4,1,0,1
11,12,UT,Blake Swihart,26,82,207,192,28,44,10,0,3,...,57,0.229,0.285,0.328,0.613,65,63,4,0,0,0,0
12,13,UT,Hanley Ramirez,34,44,195,177,25,45,7,0,6,...,35,0.254,0.313,0.395,0.708,90,70,9,2,0,2,0
13,14,1B,Steve Pearce,35,50,165,136,19,38,8,1,7,...,27,0.279,0.394,0.507,0.901,141,69,1,5,0,2,0
14,15,2B,Ian Kinsler,36,37,143,132,17,32,6,0,1,...,24,0.242,0.294,0.311,0.604,64,41,5,0,0,1,0
15,16,SS,Tzu-Wei Lin,24,37,73,65,15,16,6,1,1,...,17,0.246,0.329,0.415,0.744,100,27,0,0,0,0,0
16,17,UT,Sam Travis,24,19,38,36,5,8,3,0,1,...,10,0.222,0.263,0.389,0.652,73,14,1,0,0,0,0
17,18,UT,Brandon Phillips,37,9,27,23,4,3,0,0,1,...,7,0.130,0.259,0.261,0.520,42,6,1,0,0,0,0
18,19,2B,Dustin Pedroia,34,3,13,11,1,1,0,0,0,...,1,0.091,0.231,0.091,0.322,-7,1,0,0,0,0,0
19,20,C,Dan Butler,31,2,7,6,0,1,0,0,0,...,2,0.167,0.143,0.167,0.310,-17,1,0,0,0,1,0

### Accessing Data <br>

##### Indexing

<p>You can directly select a column of a dataframe just like you would a dict. The result is a Pandas 'Series' object.</p>

In [30]:
data_ages = data['ages']

print(data_ages)


# print out the type of the variable data
# Series
print(type(data_ages))

# DataFrame
print(type(data))

# DataSeries Index - starting at 0 
print(data_ages[3])

# key first, row index second
print(data['ages'][3])

#print(float(data_ages[0]))
# print(data_ages)

0    26
1    28
2    21
3    21
4    29
5    22
6    19
7    21
8    29
9    34
Name: ages, dtype: int64
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
21
21

##### df.loc

<p>Along the horizontal dimension, rows of Pandas DataFrames are Row objects. You will notice there is a third column present in the DataFrame - this is the $\textit{index}$. It is automatically generated as a row number, but can be reassigned to a column of your choice using the DataFrame.set_index(colname) method. We can use it to access particular Pandas $\textit{rows}$, which are also Series objects:</p>

In [65]:
print(data)
# Grab the first row of data -- by the index of the row
first_row = data.loc[0]
print(f'Data in the first (0th) row: {first_row}')
first_row
# Getting Multiple values from a df.loc
multiple_rows = data.loc[ [0,1,2] ]['names']
print(multiple_rows)
print(type(multiple_rows))

# Using df.loc and producing a Dataframe at the end
multiple_people_df = data.loc[range(3)][['names', 'ages']]
print(multiple_people_df)


# Reset our my_people dataframe index
reset_index = data.loc[[0,1,2,3]].set_index('names')
print(reset_index)

new_index = reset_index.reset_index()
new_index

# print(reset_index.loc['James'])
# print(data.loc[2])

     names  ages
0    Alice    26
1      Bob    28
2    James    21
3     Beth    21
4     John    29
5    Sally    22
6  Richard    19
7   Lauren    21
8  Brandon    29
9  Sabrina    34
Data in the first (0th) row: names    Alice
ages        26
Name: 0, dtype: object
0    Alice
1      Bob
2    James
Name: names, dtype: object
<class 'pandas.core.series.Series'>
   names  ages
0  Alice    26
1    Bob    28
2  James    21
       ages
names
Alice    26
Bob      28
James    21
Beth     21

   names  ages
0  Alice    26
1    Bob    28
2  James    21
3   Beth    21

##### keys()

In [83]:
# Access all of the keys/columns of the dataframe
# Dataframe.keys()

print(type(bs2017.keys()))
print(type(bs2017.keys().tolist()))
data.keys()
# for key in bs2017.keys().tolist():
#     print(key)
    
# bs2017.keys().tolist()

<class 'pandas.core.indexes.base.Index'>
<class 'list'>

Index(['names', 'ages'], dtype='object')

##### Slicing a DataFrame

In [88]:
# printing all data for context
data[2:5]

   names  ages
2  James    21
3   Beth    21
4   John    29

### Built-In Methods <br>

<p>These are methods that are frequently used when using Pandas to make your life easier. It is possible to spend a whole week simply exploring the built-in functions supported by DataFrames in Pandas. Here however, we will simply highlight a few ones that might be useful, to give you an idea of what's possible out of the box with Pandas:</p>

##### head()

In [95]:
# DataFrame.head()  -- Accepts integer parameter(gives access to more rows)
bs2017.head()

,Rk,Pos,Name,Age,G,PA,AB,R,H,2B,3B,HR,...,SO,BA,OBP,SLG,OPS,OPS+,TB,GDP,HBP,SH,SF,IBB
0,1,C,Christian Vazquez,26,99,345,324,43,94,18,2,5,...,64,0.290,0.330,0.404,0.735,91,131,14,3,0,1,0
1,2,1B,Mitch Moreland,31,149,576,508,73,125,34,0,22,...,120,0.246,0.326,0.443,0.769,99,225,14,6,0,5,6
2,3,2B,Dustin Pedroia,33,105,463,406,46,119,19,0,7,...,48,0.293,0.369,0.392,0.760,100,159,11,2,2,4,4
3,4,SS,Xander Bogaerts,24,148,635,571,94,156,32,6,10,...,116,0.273,0.343,0.403,0.746,95,230,17,6,0,2,6
4,5,3B,Rafael Devers,20,58,240,222,34,63,14,0,10,...,57,0.284,0.338,0.482,0.819,111,107,5,0,0,0,3

##### tail()

In [99]:
# DataFrame.tail()  -- Accepts integer parameter(gives access to more rows)
bs2017.tail()

,Rk,Pos,Name,Age,G,PA,AB,R,H,2B,3B,HR,...,SO,BA,OBP,SLG,OPS,OPS+,TB,GDP,HBP,SH,SF,IBB
18,19,IF,Marco Hernandez,24,21,60,58,7,16,3,0,0,...,15,0.276,0.300,0.328,0.628,65,19,0,1,0,0,0
19,20,UT,Rajai Davis,36,17,38,36,7,9,2,0,0,...,13,0.250,0.289,0.306,0.595,56,11,2,1,0,0,0
20,21,UT,Steve Selsky,27,8,9,9,0,1,1,0,0,...,5,0.111,0.111,0.222,0.333,-16,2,0,0,0,0,0
21,22,UT,Blake Swihart,25,6,7,5,1,1,0,0,0,...,3,0.200,0.429,0.200,0.629,74,1,0,0,0,0,0
22,23,2B,Chase d'Arnaud,30,2,1,1,2,1,0,0,0,...,0,1.000,1.000,1.000,2.000,428,1,0,0,0,0,0

##### shape

In [102]:
# The dataframe has a shape property, just like a NumPy matrix. 
# print(df.shape) -- DataFrame.shape -- No Parameter

bs2017.shape

(23, 28)

##### describe() <br>
<p>Probably one of the most important methods to understand...</p>

In [123]:
# Collect summary statistics in one line
# DataFrame.describe() -- Accepts parameters (include, exclude)

bs2018.describe()

,Rk,Age,G,PA,AB,R,H,2B,3B,HR,RBI,SB,...,SO,BA,OBP,SLG,OPS,OPS+,TB,GDP,HBP,SH,SF,IBB
count,20.00000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,...,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000
mean,10.50000,29.100000,82.350000,314.100000,280.200000,43.600000,75.250000,17.650000,1.550000,10.400000,41.300000,6.250000,...,62.150000,0.237950,0.307700,0.387500,0.695200,86.450000,127.200000,6.500000,2.750000,0.350000,2.400000,1.900000
std,5.91608,4.666792,52.916294,230.972065,203.871631,38.293053,62.462515,15.624795,1.959457,11.722224,37.559917,7.926471,...,46.688526,0.061985,0.068843,0.135884,0.200419,52.199491,113.226183,5.633546,3.274704,0.812728,2.436564,3.110255
min,1.00000,21.000000,2.000000,7.000000,6.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,1.000000,0.091000,0.143000,0.091000,0.310000,-17.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,5.75000,25.000000,37.000000,125.500000,115.250000,16.500000,28.000000,6.000000,0.000000,1.000000,13.750000,0.000000,...,22.250000,0.218250,0.262000,0.304000,0.588000,59.500000,37.500000,1.000000,0.000000,0.000000,0.000000,0.000000
50%,10.50000,29.500000,85.500000,278.500000,258.000000,29.000000,49.500000,11.000000,0.500000,6.500000,27.500000,4.500000,...,63.000000,0.243500,0.305500,0.399000,0.712500,91.000000,72.500000,5.500000,2.000000,0.000000,2.000000,0.000000
75%,15.25000,32.500000,129.250000,510.250000,475.500000,62.250000,115.000000,26.250000,3.000000,15.250000,66.500000,7.000000,...,102.000000,0.277500,0.360500,0.441000,0.788000,112.500000,192.000000,9.000000,4.250000,0.000000,4.250000,2.250000
max,20.00000,37.000000,150.000000,661.000000,579.000000,129.000000,188.000000,47.000000,6.000000,43.000000,130.000000,30.000000,...,146.000000,0.346000,0.438000,0.640000,1.078000,186.000000,358.000000,19.000000,11.000000,3.000000,7.000000,11.000000

##### sort_values()

In [134]:
# Sort based on many labels, with left-to-right priority
# sorted_data = data.sort_values('ages').reset_index()
# DataFrame.sort_values('key')
print(data)
sort_data = data.sort_values('ages').reset_index(drop=True)

sort_data

     names  ages
0    Alice    26
1      Bob    28
2    James    21
3     Beth    21
4     John    29
5    Sally    22
6  Richard    19
7   Lauren    21
8  Brandon    29
9  Sabrina    34

     names  ages
0  Richard    19
1    James    21
2     Beth    21
3   Lauren    21
4    Sally    22
5    Alice    26
6      Bob    28
7     John    29
8  Brandon    29
9  Sabrina    34

##### .columns

In [139]:
# will show all cols headers
# DataFrame.columns -- has no parameters

print(bs2017.columns)
print(f'\n The type of bos17.columns: {type(bs2017.columns)}')


print(bs2017.keys())
print(f'\n The type of bos17.keys(): {type(bs2017.keys())}')

Index(['Rk', 'Pos', 'Name', 'Age', 'G', 'PA', 'AB', 'R', 'H', '2B', '3B', 'HR',
       'RBI', 'SB', 'CS', 'BB', 'SO', 'BA', 'OBP', 'SLG', 'OPS', 'OPS+', 'TB',
       'GDP', 'HBP', 'SH', 'SF', 'IBB'],
      dtype='object')

 The type of bos17.columns: <class 'pandas.core.indexes.base.Index'>
Index(['Rk', 'Pos', 'Name', 'Age', 'G', 'PA', 'AB', 'R', 'H', '2B', '3B', 'HR',
       'RBI', 'SB', 'CS', 'BB', 'SO', 'BA', 'OBP', 'SLG', 'OPS', 'OPS+', 'TB',
       'GDP', 'HBP', 'SH', 'SF', 'IBB'],
      dtype='object')

 The type of bos17.keys(): <class 'pandas.core.indexes.base.Index'>

In [138]:
print(bs2017.columns.__dict__)

{'_data': array(['Rk', 'Pos', 'Name', 'Age', 'G', 'PA', 'AB', 'R', 'H', '2B', '3B',
       'HR', 'RBI', 'SB', 'CS', 'BB', 'SO', 'BA', 'OBP', 'SLG', 'OPS',
       'OPS+', 'TB', 'GDP', 'HBP', 'SH', 'SF', 'IBB'], dtype=object), '_index_data': array(['Rk', 'Pos', 'Name', 'Age', 'G', 'PA', 'AB', 'R', 'H', '2B', '3B',
       'HR', 'RBI', 'SB', 'CS', 'BB', 'SO', 'BA', 'OBP', 'SLG', 'OPS',
       'OPS+', 'TB', 'GDP', 'HBP', 'SH', 'SF', 'IBB'], dtype=object), '_name': None, '_id': <object object at 0x7f86d900f5c0>, '_cache': {'dtype': dtype('O'), '_engine': <pandas._libs.index.ObjectEngine object at 0x7f86f88f56b0>, 'is_all_dates': False, 'inferred_type': 'string'}}

### In-Class Exercise #2 - Describe & Sort Boston Red Sox Hitting Data <br>
<p>Take the data that you read in earlier from the Red Sox csv's and use the describe method to understand the data better. Compare the two years' average hits and decide which team is having the better year.</p>

In [163]:
if bs2017.mean().H > bs2018.mean().H:
    answer = '17 was better'
else:
    answer = '18 was better'
answer

########

h17 = bs2017['H'].describe()['mean']
h18 = bs2018['H'].describe()['mean']

if bs2017['H'].describe()['mean'] > bs2018['H'].describe()['mean']:
    print('2017 was better')
else:
    print('2018 was better')

2018 was better

### Filtration <br>
<p>Let's look at how to filter dataframes for rows that fulfill a specific conditon.</p>

##### Conditionals

In [167]:
# Conditional boolean dataframe
data['ages'] >= 25

0     True
1     True
2    False
3    False
4     True
5    False
6    False
7    False
8     True
9     True
Name: ages, dtype: bool

##### Subsetting

In [177]:
# exactly like numpy
# data[data['ages'] >= 25]

twenty_five_plus = data[data['ages'] >= 25].sort_values('ages').reset_index(drop=True)

twenty_five_plus

     names  ages
0    Alice    26
1      Bob    28
2     John    29
3  Brandon    29
4  Sabrina    34

### Column Transformations <br>
<p>Rarely, if ever, will the columns in the original raw dataframe read from CSV or database table be the ones you actually need for your analysis. You will spend lots of time constantly transforming columns or groups of columns using general computational operations to produce new ones that are functions of the old ones. Pandas has full support for this: Consider the following dataframe containing membership term and renewal number for a group of customers:</p>

In [182]:
# Generate some fake data
customer_id = np.random.randint(1000,1100, 10)

renewal_nbr = np.random.randint(0,10,10)

customer_dict = {1: 0.5, 0: 1}
terms_in_years = [customer_dict[key] for key in np.random.randint(0,2,10)]

random_data = {
    'customer_id': customer_id,
    'renewal_nbr': renewal_nbr,
    'term_in_years': terms_in_years
}

customers = pd.DataFrame.from_dict(random_data)
customers

   customer_id  renewal_nbr  term_in_years
0         1020            1            1.0
1         1042            2            0.5
2         1011            6            1.0
3         1016            4            0.5
4         1093            1            1.0
5         1091            9            0.5
6         1031            4            0.5
7         1080            4            1.0
8         1031            5            0.5
9         1053            0            0.5

##### Generating a New Column w/Data

In [183]:
# DataFrame['key'] = Some Calculation from our DataFrame Columns
customers['customer_tenure'] = customers['renewal_nbr'] * customers['term_in_years']
customers

   customer_id  renewal_nbr  term_in_years  customer_tenure
0         1020            1            1.0              1.0
1         1042            2            0.5              1.0
2         1011            6            1.0              6.0
3         1016            4            0.5              2.0
4         1093            1            1.0              1.0
5         1091            9            0.5              4.5
6         1031            4            0.5              2.0
7         1080            4            1.0              4.0
8         1031            5            0.5              2.5
9         1053            0            0.5              0.0

##### User Defined Function

<p>If what you want to do to a column that can't be represented by simple mathematical operations, you can write your own $\textit{user defined function}$ with the full customizability available in Python and any external Python packages, then map it directly onto a column. Let's add some ages to our customer dataframe, and then classify them into our custom defined grouping scheme:</p>

In [185]:
# use .apply to map over dataframe

# Create a new column for ages
customers['ages'] = np.random.randint(18,70,10)
customers

# user defined function to give an age group based on the ages column

def make_groups(age):
    if age < 20:
        return 'Teenager'
    elif age < 40:
        return 'Young Adult'
    elif age < 65:
        return 'Adult'
    else:
        return 'Senior'
    
customers['age_group'] = customers['ages'].apply(make_groups)
customers

   customer_id  renewal_nbr  term_in_years  customer_tenure  ages    age_group
0         1020            1            1.0              1.0    19     Teenager
1         1042            2            0.5              1.0    69       Senior
2         1011            6            1.0              6.0    55        Adult
3         1016            4            0.5              2.0    28  Young Adult
4         1093            1            1.0              1.0    40        Adult
5         1091            9            0.5              4.5    35  Young Adult
6         1031            4            0.5              2.0    59        Adult
7         1080            4            1.0              4.0    49        Adult
8         1031            5            0.5              2.5    41        Adult
9         1053            0            0.5              0.0    37  Young Adult

<p>As a last example I'll show here how you would use a lambda function to create a UDF that depends on $\textit{more than one}$ column:</p>

<li>UDF = User Defined Function</li>

In [194]:
#Axis for apply can only be 1 or 0 -- 1 being the X axis 0 being the Y axis

def make_loyalty_age_group(row):
    age = row['ages']
    tenure = row['customer_tenure']
    
    if age < 20:
        age_group = 'Teenager'
    elif age < 40:
        age_group = 'Young Adult'
    elif age < 65:
        age_group = 'Adult'
    else:
        age_group = 'Senior'
    
    if tenure > 2:
        loyalty_age_group = f'Loyal {age_group}'
    else:
        loyalty_age_group = f'New {age_group}'
    
    return loyalty_age_group

customers['loyalty_age_group'] = customers.apply(make_loyalty_age_group, axis = 1)

customers

,customer_id,renewal_nbr,term_in_years,customer_tenure,ages,age_group,loyalty_age_group
0,1020,1,1.0,1.0,19,Teenager,New Teenager
1,1042,2,0.5,1.0,69,Senior,New Senior
2,1011,6,1.0,6.0,55,Adult,Loyal Adult
3,1016,4,0.5,2.0,28,Young Adult,New Young Adult
4,1093,1,1.0,1.0,40,Adult,New Adult
5,1091,9,0.5,4.5,35,Young Adult,Loyal Young Adult
6,1031,4,0.5,2.0,59,Adult,New Adult
7,1080,4,1.0,4.0,49,Adult,Loyal Adult
8,1031,5,0.5,2.5,41,Adult,Loyal Adult
9,1053,0,0.5,0.0,37,Young Adult,New Young Adult

### In-Class Exercise #3 - Create Your Own UDF <br>
<p>Using the 2017 Boston Red Sox data, create your own UDF which creates a new column called 'All-Star' and puts every player with either a batting average over .280 or an on base percentage of .360 or over with a result of 'Yes' in the column and 'No' if not.</p>

In [209]:
"""
    Name  BA OBP AllStar
    --------------------
    Name .233 .360 Yes
    Name .150 .288 No
"""
def is_allstar(row):
    ba = row['BA']
    obp = row['OBP']
    
    if ba > .28 or obp > .36:
        all_star = 'Yes'
    else:
        all_star = 'No'
    return all_star

bs2017['AllStar'] = bs2017.apply(is_allstar, axis=1)
#loc can specify location based on any column + condition
bs2017[['Name', 'BA', 'OBP', 'AllStar']].loc[bs2017['AllStar'] == 'Yes']

                 Name     BA    OBP AllStar
0   Christian Vazquez  0.290  0.330     Yes
2      Dustin Pedroia  0.293  0.369     Yes
4       Rafael Devers  0.284  0.338     Yes
12      Eduardo Nunez  0.321  0.353     Yes
17        Tzu-Wei Lin  0.268  0.369     Yes
21      Blake Swihart  0.200  0.429     Yes
22     Chase d'Arnaud  1.000  1.000     Yes

### Aggregations <br>
<p>The raw data plus some transformations is generally only half the story. Your objective is to extract actual insights and actionable conclusions from the data, and that means reducing it from potentially billions of rows to some summary statistics via aggregation functions.</p>

##### groupby() <br>
<p>The .groupby() function is in some ways a 'master' aggregation.</p> 

<p>Data tables will usually reserve one column as a primary key - that is, a column for which each row has a unique value. This is to facilitate access to the exact rows of a data table that a user wants to view. The other columns will often have repeated values, such as the age groups in the above examples. We can use these columns to explore the data using the Pandas API:</p>

In [215]:
# also introducing .count() here, exact same as to how it's used in SQL

# Using the groupby with the column intact as a column/key
# customers.groupby('age_group', as_index = False).count()[['customer_id','age_group']]

customers.groupby('age_group').count()

#as_index defaults to True
customers.groupby('age_group', as_index = False).count()

,age_group,customer_id,renewal_nbr,term_in_years,customer_tenure,ages,loyalty_age_group
0,Adult,5,5,5,5,5,5
1,Senior,1,1,1,1,1,1
2,Teenager,1,1,1,1,1,1
3,Young Adult,3,3,3,3,3,3

##### Type of groupby()

<p>The result is a new dataframe, the columns of which all contain the counts of the grouped field. Notice the type of a grouped dataframe:</p>

In [213]:
print(type(customers), 'Regular Data Frame')
print(f'\n Type of Group By for Customer.GroupBy: {type(customers.groupby("age_group"))}')

<class 'pandas.core.frame.DataFrame'> Regular Data Frame

 Type of Group By for Customer.GroupBy: <class 'pandas.core.groupby.generic.DataFrameGroupBy'>

<p>This is because simply grouping data doesn't quite make sense without an aggregation function like count() to pair with. In this case, we're counting occurances of the grouped field, but that's not all we can do. We can take averages, standard deviations, mins, maxes and much more! Let's see how this works a bit more:</p>

##### mean()

In [219]:
# mean = average
customers.groupby('age_group').mean()[['customer_tenure','ages']].sort_values('customer_tenure', ascending=False)

             customer_tenure       ages
age_group
Adult               3.100000  48.800000
Young Adult         2.166667  33.333333
Senior              1.000000  69.000000
Teenager            1.000000  19.000000

##### groupby() w/Multiple Columns

<p>We end up with the average age of the groups in the last column, the average tenure in the tenure column, and so on and so forth. You can even split the groups more finely by passing a list of columns to group by:</p>

In [221]:
customers.groupby(['age_group','ages']).mean().sort_values('ages')

                  customer_id  renewal_nbr  term_in_years  customer_tenure
age_group   ages
Teenager    19           1020            1            1.0              1.0
Young Adult 28           1016            4            0.5              2.0
            35           1091            9            0.5              4.5
            37           1053            0            0.5              0.0
Adult       40           1093            1            1.0              1.0
            41           1031            5            0.5              2.5
            49           1080            4            1.0              4.0
            55           1011            6            1.0              6.0
            59           1031            4            0.5              2.0
Senior      69           1042            2            0.5              1.0

##### drop_duplicates()

<p>Drops all duplicates from the current dataframe</p>

In [222]:
customers

,customer_id,renewal_nbr,term_in_years,customer_tenure,ages,age_group,loyalty_age_group
0,1020,1,1.0,1.0,19,Teenager,New Teenager
1,1042,2,0.5,1.0,69,Senior,New Senior
2,1011,6,1.0,6.0,55,Adult,Loyal Adult
3,1016,4,0.5,2.0,28,Young Adult,New Young Adult
4,1093,1,1.0,1.0,40,Adult,New Adult
5,1091,9,0.5,4.5,35,Young Adult,Loyal Young Adult
6,1031,4,0.5,2.0,59,Adult,New Adult
7,1080,4,1.0,4.0,49,Adult,Loyal Adult
8,1031,5,0.5,2.5,41,Adult,Loyal Adult
9,1053,0,0.5,0.0,37,Young Adult,New Young Adult

In [223]:
customers_copy = customers.drop_duplicates('renewal_nbr').reset_index(drop=True)
customers_copy

,customer_id,renewal_nbr,term_in_years,customer_tenure,ages,age_group,loyalty_age_group
0,1020,1,1.0,1.0,19,Teenager,New Teenager
1,1042,2,0.5,1.0,69,Senior,New Senior
2,1011,6,1.0,6.0,55,Adult,Loyal Adult
3,1016,4,0.5,2.0,28,Young Adult,New Young Adult
4,1091,9,0.5,4.5,35,Young Adult,Loyal Young Adult
5,1031,5,0.5,2.5,41,Adult,Loyal Adult
6,1053,0,0.5,0.0,37,Young Adult,New Young Adult

In [225]:
# Send customer data into a CSV file
customers_copy.to_csv('../files/customers.csv')

<p>Thus the groupby operation allows you to rapidly make summary observations about the state of your entire dataset at flexible granularity. In one line above, we actually did something very complicated - that's the power of the dataframe. In fact, the process often consists of several iterative groupby operations, each revealing greater insight than the last - if you don't know where to start with a dataset, try a bunch of groupbys!</p>

### Homework Excersise #1 - Find the Total Number of Runs and RBIs for the Red Sox <br>
<p>Get total number of home runs and rbi's</p>

In [10]:
# step 1: Add a new column with the key 'Team' and all column values should be 'BOS'

# step 2: Group by the 'Team' column and get total home runs and rbi's

# Produce data for both 2017 and 2018 (ie print both seperated by a newline character \n)
# Extra Credit - concatenate your 2 final dataframes into one dataframe output
"""
TEAM    HR   RBI
----------------
BOS     144  538
"""
bs2017['TEAM'] = 'BOS17'
bs2018['TEAM'] = 'BOS18'

test17 = bs2017.groupby('TEAM').sum()[['HR','RBI']]
test18 = bs2018.groupby('TEAM').sum()[['HR','RBI']]

test_t = pd.concat([test17,test18])

test_t.reset_index()

    TEAM   HR  RBI
0  BOS17  168  735
1  BOS18  208  826

## Find the average age of runners in the 2017 Boston Marathon

In [12]:
print('The average age of a Boston Marathon runner in 2017 is', marathon.mean()['Age'], 'years old.')

The average age of a Boston Marathon runner in 2017 is 42.587731919727375 years old.